       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB01.
      *********************************************
      *    AREA DE COMENTÁRIOS - REMARKS
      *    AUTHOR  = LUIS FERNANDO
      *    OBJETIVO: MOSTRAR UMA MSG DE HELLO WORLD
      *    DATA    = 01/06/2021
      *********************************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY 'Hello World!'.
           STOP RUN.