       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRGCOB01.
      ******************************************************
      ***   AREA DE COMENTARIOS - REMARKS 
      ***   OBJETIVO DO PROGRAMA = MOSTRAR A STRING HELLO WORLD
      ***   AUTOR: LUIS FERNANDO
      ***   DATA : 01/06/2021
      ******************************************************      
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           DISPLAY 'Hello World'.
           STOP RUN.